#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

heroku_app.guestbook_app: Refreshing state... [id=cicd-series-guestbook]
heroku_build.guestbook_build: Refreshing state... [id=a71ef5f0-bc32-4ab8-816d-22c2bd183940]
heroku_formation.guestbook_formation: Refreshing state... [id=df60c0ee-47a1-4e74-b3b7-889f974a2003]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # heroku_build.guestbook_build must be replaced
-/+ resource "heroku_build" "guestbook_build" {
        app               = "cicd-series-guestbook"
        buildpacks        = [
            "https://github.com/heroku/heroku-buildpack-scala",
        ]
      ~ id                = "a71ef5f0-bc32-4ab8-816d-22c2bd183940" -> (known after apply)
      + local_checksum    = (known after apply)
      ~ output_stream_url = "https://build-output.heroku.com/streams/1c/1c527e89-e484-4a2f-af7c-b173ad65b6f2/logs/a7/a71ef5f0-bc32-4ab8-816d-22c2bd183940.log?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIQI6BAUWXGR4S77Q%2F20200702%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20200702T214730Z&X-Amz-Expires=86400&X-Amz-SignedHeaders=host&X-Amz-Signature=ceec1e519dffa8c31c1c485de34f242832baab1f292f7f7b0511424e82ee3620" -> (known after apply)
      ~ release_id        = "8bf2f842-ea30-48a1-a955-0d6e8b9aaa9c" -> (known after apply)
      ~ slug_id           = "eb6845b9-11f9-4b35-99fb-617c3f4669ec" -> (known after apply)
      ~ source            = { # forces replacement
          ~ "url" = "https://github.com/DWiechert/cicd-series/archive/0.1.0-12.tar.gz" -> "https://github.com/DWiechert/cicd-series/releases/tag/0.0.1.tar.gz"
        }
      ~ stack             = "heroku-18" -> (known after apply)
      ~ status            = "succeeded" -> (known after apply)
      ~ user              = {
          - "email" = "dan.wiechert@gmail.com"
          - "id"    = "0b9f1fa4-3b8c-4831-9065-b01d0312e428"
        } -> (known after apply)
      ~ uuid              = "a71ef5f0-bc32-4ab8-816d-22c2bd183940" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @DWiechert, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Requests CI`*